Repository: noparvar/woocommerce-pardakhtnovin-gateway
Catalog: languages/wc-pardakhtnovin-*.po
Languages: fa_ir

source: Pardakhtnovin Gateway
fa_ir: درگاه پرداخت نوین

source: The WooCommerce Pardakhtnovin Gateway Plugin allows you to integrate the Pardakhtnovin payment gateway with your WooCommerce store.
fa_ir: افزونه درگاه پرداخت نوین این امکان را به شما می دهد تا فروشگاه خود را به درگاه پرداخت نوین (بانک اقتصاد نوین) متصل کنید.

source: Pardkhtnovin Gateway Settings
fa_ir: تنظیمات درگاه پرداخت نوین

source: Certificate file settings
fa_ir: تنظیمات فایل certificate

source: Upload the certificate file
fa_ir: آپلود فایل certificate

source: Choose the certificate file
fa_ir: انتخاب فایل certificate

source: The certificate file is already uploaded.
fa_ir: فایل certificate آپلود شده است و نیازی به انتخاب دوباره آن نیست.

source: The certificate file is not uploaded yet.
fa_ir: فایل certificate هنوز آپلود نشده است. لطفاً آن را انتخاب نمایید.

source: The certificate file must have pem extension.
fa_ir: فایل certificate باید پسوند pem داشته باشد.

source: The Home directory is not writable!
fa_ir: متاسفانه اجازه ی لازم برای آپلود فایل در دایرکتوری Home وجود ندارد. لطفا این مشکل را با ادمین هاست خود در میان بگذارید!

source: Pardakhtnovin Account Configurations
fa_ir: تنظیمات حساب پرداخت نوین

source: Terminal ID
fa_ir: ترمینال آی دی

source: Terminal ID of Pardakhtnovin Gateway
fa_ir: شماره ترمینال درگاه پرداخت نوین

source: Username
fa_ir: نام کاربری

source: Username of Pardakhtnovin Gateway
fa_ir: نام اربری رگاه پرداخت نوین

source: Password
fa_ir: کلمه عبور

source: Password of Pardakhtnovin Gateway
fa_ir: کلمه عبور درگاه پرداخت نوین

source: Certificate Password
fa_ir: کلمه عبور certificate

source: Plugin Configurations
fa_ir: تنظیمات افزونه

source: Enable / Disable
fa_ir: فعالسازی / غیرفعالسازی

source: Enable
fa_ir: فعالسازی

source: Check to enable Novinpardakht Gateway
fa_ir: برای فعالسازی درگاه پرداخت نوین تیک بزنید

source: Gateway Title
fa_ir: عنوان درگاه

source: Enter the title you want to display to the user during checkout and payment
fa_ir: عنوانی که می خواهید که به هنگام پرداخت به کاربر نمایش داده شود را وارد کنید

source: Pardakhtnovin
fa_ir: پرداخت نوین

source: Gateway Description
fa_ir: توضیحات درگاه

source: Enter the description you want to display to the user during checkout and payment
fa_ir: توضیحاتی که می خواهید که به هنگام پرداخت به کاربر نمایش داده شود را وارد کنید

source: Secure payment with all Shetab Cards with Pardakhtnovin
fa_ir: پرداخت امن به وسیله کلیه کارت های عضو شتاب از طریق درگاه پرداخت نوین

source: Payment Configurations
fa_ir: تنظیمات پرداخت

source: Successful Payment Message
fa_ir: پیام پرداخت موفق

source: Enter the message you want to display to the user after a successful payment. You can also use the shortcode {transaction_id} to display the transaction tracking code and {SaleOrderId} to display the payment request number.
fa_ir: متن پیامی که میخواهید بعد از پرداخت موفق به کاربر نمایش دهید را وارد نمایید . همچنین می توانید از شورت کد {transaction_id} برای نمایش کد رهگیری ( کد مرجع تراکنش ) و از شرت کد {SaleOrderId} برای شماره درخواست تراکنش پرداخت نوین استفاده نمایید .

source: Thank you. Your order has been successfully paid. Your payment transaction tracking code is {transaction_id} and the payment request number is {SaleOrderId}.
fa_ir: با تشکر از شما . سفارش شما با موفقیت پرداخت شد. کد رهگیری پرداخت شما {transaction_id} و شماره درخواست تراکنش {SaleOrderId} می باشند.

source: Cancellation Message
fa_ir: پیام انصراف از پرداخت

source: Enter the message you want to display to the user after they cancel the payment. This message will be shown after returning from the bank.
fa_ir: متن پیامی که میخواهید بعد از انصراف کاربر از پرداخت نمایش دهید را وارد نمایید . این پیام بعد از بازگشت از بانک نمایش داده خواهد شد .

source: Your payment has been canceled.
fa_ir: پرداخت به دلیل انصراف شما ناتمام باقی ماند .

source: Failed Payment Message
fa_ir: پیام پرداخت ناموفق

source: Enter the message you want to display to the user after a payment failure. You can also use the shortcode {fault} to display the reason for the error. This error reason is sent from PardakhtNovin payment gateway.
fa_ir: متن پیامی که میخواهید بعد از پرداخت ناموفق به کاربر نمایش دهید را وارد نمایید . همچنین می توانید از شورت کد {fault} برای نمایش دلیل خطای رخ داده استفاده نمایید . این دلیل خطا از پرداخت نوین ارسال میگردد .

source: Your payment has failed. Please try again or contact the site administrator if you encounter any issues.
fa_ir: پرداخت شما ناموفق بوده است . لطفا مجددا تلاش نمایید یا در صورت بروز اشکال با مدیر سایت تماس بگیرید .

source: The uploaded file extension is not pem. Please upload the correct file.
fa_ir: پسوند فایل آپلود شده pem نمی باشد. لطفا فایل صحیح را آپلود نمایید.

source: Error uploading the certificate file. Please check the access to the home directory on your server.
fa_ir: خطا در آپلود فایل certificate. لطفا قابلیت دسترسی به دایرکتوری home در سرور خود را چک نمایید.

source: The certificate file was successfully uploaded.
fa_ir: فایل certificate با موفقیت آپلود شد.

source: An error occurred while connecting to the payment gateway: <br/>%s
fa_ir: خطا در هنگام ارسال به درگاه پرداخت : %s

source: Pay
fa_ir: پرداخت

source: Back to checkout
fa_ir: بازگشت

source: Connecting to payment gateway...
fa_ir: در حال اتصال به درگاه پرداخت...

source: Payment was successful.<br/>Transaction Tracking Code (Reference Code): %s <br/> Transaction Request Number: %s
fa_ir: پرداخت موفقیت آمیز بود .<br/> کد رهگیری (کد مرجع تراکنش) : %s <br/> شماره درخواست تراکنش : %s

source: Order number does not exist.
fa_ir: شماره سفارش وجود ندارد.

source: WooCommerce Pardakhtnovin Gateway
fa_ir: درگاه پرداخت نوین ووکامرس

source: Integrate the Pardakhtnovin payment gateway seamlessly into your WooCommerce store. Provide a reliable and user-friendly payment option for your customers, enhancing their checkout experience.
fa_ir: افزونه درگاه پرداخت نوین این امکان را به شما می دهد تا فروشگاه خود را به درگاه پرداخت نوین (بانک اقتصاد نوین) متصل کنید.

source: Mohsen Noparvar
fa_ir: محسن نوع پرور
